"""
Задача №4.
Дано рядок. Замініть у цьому рядку всі входження певної літери англійського алфавіту, який вводить користувача в нижній реєстр, на відповідну літеру у верхньому реєстрі. Спочатку вводиться літера, а потім рядок, у якому потрібно виконати заміну.
Автор: Волочнюк Поліна іванівна
"""

letter = input("Введіть літеру: ")  # Ввід літери для заміни
text = input("Введіть текст: ")  # Ввід тексту
modified_text = text.replace(letter.lower(), letter.upper())  # Заміна входжень літери у тексті
print(modified_text)  # Вивід модифікованого тексту
