"""
Задача №2.
Потрібно підрахувати, на скільки раніше буде закінчуватися k-й урок, якщо всі перерви скоротити на 5 хвилин. Вводиться одне натуральне число k, не більше 7. Необхідно вивести одне натуральне число - час у хвилинах.
Автор: Волочнюк Поліна іванівна
"""

k = int(input("Введіть номер уроку (не більше 7): "))  # Ввід номеру уроку
time_saved = 5 * (k - 1)  # Розрахунок зекономленого часу

print(time_saved)  # Вивід часу у хвилинах
