"""
Задача №3.
Напишіть програму для друку літери Е висотою 5 рядків за допомогою введеного користувачем символу.
Автор: Волочнюк Поліна іванівна
"""

symbol = input("Введіть символ для виведення літери 'Е' (наприклад, 'E', '*', '#', тощо): ")  # Ввід символу

# Виведення літери 'Е' висотою 5 рядків за допомогою введеного користувачем символу
print(symbol * 5)
print(symbol)
print(symbol)
print(symbol)
print(symbol * 5)
